temp1/src/Documents/Трудозатраты/Трудозатраты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Трудозатраты</name>
  <registerRecords>AccumulationRegister.ДоходыИсполнителей</registerRecords>
  <registerRecords>AccumulationRegister.кт_УчтенныеЗадачи</registerRecords>
  <registerRecords>AccumulationRegister.УчетТрудозатрат</registerRecords>
  <registerRecords>AccumulationRegister.ФактическиеЧасыПоЗадачам</registerRecords>
  <registerRecords>AccumulationRegister.ТрудозатратыПланФактические</registerRecords>
  <registerRecords>AccumulationRegister.Задолженность</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Заказчик</name>
    <type>
      <types>CatalogRef.Заказчики</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Отдел</name>
    <type>
      <types>CatalogRef.ГруппыПользователей</types>
    </type>
  </attributes>
  <attributes>
    <name>РеализацияВБухгалтерии</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияТрудозатрат</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаОплатыЗаказчиком</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаОплатыИсполнителям</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОплатаПоТарифу</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаКорректируемая</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеПлатежа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <comment>Свойство</comment>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <comment>Значение</comment>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Оплата</name>
    <attributes>
      <name>Номер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Поступление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПроектыПоЗаказчику</name>
    <attributes>
      <name>Проекты</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
    <attributes>
      <name>ВключитьВОтбор</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Работы</name>
    <attributes>
      <name>Задача</name>
      <type>
        <types>DocumentRef.Задачи</types>
      </type>
    </attributes>
    <attributes>
      <name>Проект</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоФактическое</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

temp1/src/AccumulationRegisters/ДоходыИсполнителей/ДоходыИсполнителей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДоходыИсполнителей</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Заказчик</name>
    <type>
      <types>CatalogRef.Заказчики</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

temp1/src/AccumulationRegisters/кт_УчтенныеЗадачи/кт_УчтенныеЗадачи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>кт_УчтенныеЗадачи</name>
  <registerType>Turnovers</registerType>
  <dimensions>
    <name>Задача</name>
    <type>
      <types>DocumentRef.Задачи</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

temp1/src/AccumulationRegisters/УчетТрудозатрат/УчетТрудозатрат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>УчетТрудозатрат</name>
  <resources>
    <name>Трудоемкость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Продолжительность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.Задачи</types>
      <types>DocumentRef.Трудозатраты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Заказчик</name>
    <type>
      <types>CatalogRef.Заказчики</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыЗадач</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

temp1/src/AccumulationRegisters/Задолженность/Задолженность.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Задолженность</name>
  <resources>
    <name>СуммаДляАкта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Заказчики</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.Задачи</types>
      <types>DocumentRef.Трудозатраты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

temp1/src/AccumulationRegisters/ТрудозатратыПланФактические/ТрудозатратыПланФактические.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТрудозатратыПланФактические</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>ЧасыФактические</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЧасыПлановые</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаФактическая</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Заказчики</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.Трудозатраты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

temp1/src/Documents/Трудозатраты/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Количество = Работы.Итог("Количество");
	Сумма = Работы.Итог("Сумма");
	СуммаОплатыЗаказчиком = 0;
	СуммаОплатыИсполнителям = 0;
	Для Каждого СтрокаТЧ Из Оплата Цикл
		Если ЗначениеЗаполнено(СтрокаТЧ.Дата) Тогда
			Если СтрокаТЧ.Сумма < 0 Тогда
				СуммаОплатыЗаказчиком = СуммаОплатыЗаказчиком - СтрокаТЧ.Сумма;
			ИначеЕсли Не СтрокаТЧ.Исполнитель.Пустая() Тогда
				СуммаОплатыИсполнителям = СуммаОплатыИсполнителям + СтрокаТЧ.Сумма;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если Оплата.Количество() <> 0 Тогда
	РазмерОплаты = 0;
	Движения.ДоходыИсполнителей.Записывать = Истина;
	Для Каждого СтрокаОплаты Из Оплата Цикл

		Если ЗначениеЗаполнено(СтрокаОплаты.Поступление) Тогда
			РазмерОплаты = РазмерОплаты + СтрокаОплаты.Сумма;
		КонецЕсли;

		Если СтрокаОплаты.Дата = '00010101' ИЛИ СтрокаОплаты.Сумма = 0 ИЛИ СтрокаОплаты.Исполнитель.Пустая() Тогда
			Продолжить;
		КонецЕсли;
		Движение = Движения.ДоходыИсполнителей.Добавить();
		Движение.Период = СтрокаОплаты.Дата;
		Движение.Организация = Организация;
		Движение.Исполнитель = СтрокаОплаты.Исполнитель;
		Движение.Заказчик = Заказчик;
		Движение.Сумма = СтрокаОплаты.Сумма;
	КонецЦикла;
	
	Движения.кт_УчтенныеЗадачи.Записывать = Истина;
	Движения.УчетТрудозатрат.Записывать = Истина;
	Для Каждого ТекСтрокаРаботы Из Работы Цикл
		ДвижениеУЗ = Движения.кт_УчтенныеЗадачи.Добавить();
		ДвижениеУЗ.Период = Дата;
		ДвижениеУЗ.Задача = ТекСтрокаРаботы.Задача;

		ДвижениеУТ = Движения.УчетТрудозатрат.Добавить();
		ДвижениеУТ.ВидДвижения = ВидДвиженияНакопления.Приход;
		ДвижениеУТ.Период = Дата;
		ДвижениеУТ.Заявка = ТекСтрокаРаботы.Задача;
		ДвижениеУТ.Заказчик = Заказчик;
		ДвижениеУТ.Проект = ТекСтрокаРаботы.Проект; 
		ДвижениеУТ.Трудоемкость = ТекСтрокаРаботы.КоличествоФактическое;
		ДвижениеУТ.Продолжительность = ТекСтрокаРаботы.Количество;
		ДвижениеУТ.Сумма = ТекСтрокаРаботы.Сумма;
	КонецЦикла;
	
		
	Движения.Задолженность.Записывать = Истина;
	Движение = Движения.Задолженность.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.Клиент = Заказчик;
	Движение.Документ = Ссылка;
	Движение.СуммаДляАкта = РазмерОплаты;
	
	КонецЕсли;

	Движения.УчетТрудозатрат.Записывать = Истина;
	Для Каждого ТекСтрокаРаботы Из Работы Цикл
		ДвижениеУТ = Движения.УчетТрудозатрат.Добавить();
		ДвижениеУТ.ВидДвижения = ВидДвиженияНакопления.Приход;
		ДвижениеУТ.Период = Дата;
		ДвижениеУТ.Заявка = ТекСтрокаРаботы.Задача;
		ДвижениеУТ.Заказчик = Заказчик;
		ДвижениеУТ.Проект = ТекСтрокаРаботы.Проект; 
		ДвижениеУТ.Трудоемкость = ТекСтрокаРаботы.КоличествоФактическое;
		ДвижениеУТ.Продолжительность = ТекСтрокаРаботы.Количество;
		ДвижениеУТ.Сумма = ТекСтрокаРаботы.Сумма;
	КонецЦикла;

	Движения.ТрудозатратыПланФактические.Записывать = Истина;
	Движение = Движения.ТрудозатратыПланФактические.Добавить();
	Движение.Период = Дата;
	Движение.Клиент = Заказчик;
	Движение.Документ = Ссылка;
	Движение.ЧасыФактические = Работы.Итог("КоличествоФактическое");	
	Движение.ЧасыПлановые = Работы.Итог("Количество");
	Движение.СуммаФактическая = СуммаКорректируемая;
	
	Движения.Задолженность.Записывать = Истина;
	Движение = Движения.Задолженность.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Клиент = Заказчик;
	Движение.Документ = Ссылка;
	Движение.СуммаДляАкта = СуммаКорректируемая;
	
КонецПроцедуры
